class NameList():
    def __init__(self):
        self.alphabet = 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
        self.name = {
            "А": ["Александр", "Алексей", "Артем", "Алина", "Алиса", "Алла"],
            "Б": ["Богдан", "Борис", "Белла", "Берта"],
            "В": ["Владимир", "Валентин", "Варя", "Василиса"],
            "Г": ["Григорий", "Георгий", "Габриэлла", "Гермиона"],
            "Д": ["Денис", "Даша", "Данил", "Диана"],
            "Е": ["Есения", "Евгений", "Ева", "Елена"],
            "Ё": ["Есения", "Евгений", "Ева", "Елена"],
            "Ж": ["Жан", "Ждан", "Жорж", "Жанна"],
            "З": ["Зоя", "Зина", "Захар", "Злата"],
            "И": ["Игорь", "Иван", "Инна", "Ирина"],
            "Й": ["Игорь", "Иван", "Инна", "Ирина"],
            "К": ["Ксения", "Кирилл", "Клара", "Королина"],
            "Л": ["Любовь", "Лилиана", "Лев", "Леопольд"],
            "М": ["Миша", "Маша", "Маргарита", "Мирослава"],
            "Н": ["Надежда", "Ника", "Николай", "Наташа"],
            "О": ["Олег", "Оливия", "Оуэн", "Ольга"],
            "П": ["Павел", "Петр", "Полина", "Паулина"],
            "Р": ["Роман", "Роза", "Раиса", "Радик"],
            "С": ["Саша", "Соня", "Сергей", "Слава"],
            "Т": ["Татьяна", "Таисия", "Тимур", "Теона"],
            "У": ["Ульяна", "Уве", "Ульмас", "Уна"],
            "Ф": ["Федор", "Фекла", "Фая", "Фаня"],
            "Х": ["Харитон", "Хлоя", "Хенни", "Хавронья"],
            "Ц": ["Цветан", "Цветана", "Цавар", "Цагар"],
            "Ч": ["Чебурашка", "Че", "Чи", "Чингисхан"],
            "Ш": ["Шамиль", "Шаром", "Шлома", "Шахмурат"],
            "Щ": ["Щедра", "Щапа", "Щеня", "Щек"],
            "Ъ": ["Нет такого"],
            "Ы": ["Ыскак", "Ыбырайкан", "Ыбак", "Ыбырагим"],
            "Ь": ["Нет такого"],
            "Э": ["Эмилия", "Эдуард", "Эрастофенг", "Эрик"],
            "Ю": ["Юля", "Юрий", "Юла", "Юлий"],
            "Я": ["Яков", "Ярослав", "Яна", "Ян"]
        }
        self.listName = ["Иван", "Мария", "Петр", "Илья"]
        print(self.thesaurus(self.listName))

    def thesaurus(self, listName):
        dName = {}
        for name in listName:
            dName[name[0]] = self.name[name[0]]
        return dName

if __name__ == '__main__':
    nm = NameList()